Tekla Open API Reference for Tekla Structures 2025
OBB.ClosestPointTo Method (Line)
 Calculates the closest point in OBB to given Line.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point ClosestPointTo(
	Line line
)
Public Function ClosestPointTo (
	line As Line
) As Point
Parameters
line
Type: Tekla.Structures.Geometry3d.Line
Line to calculate against.
Return Value
Type: Point
Closest point in OBB to given Line.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is assigned to the line parameter.
See Also
Reference
OBB Class
ClosestPointTo Overload
Tekla.Structures.Geometry3d Namespace